{"format": "layers-model", "weightsManifest": [{"weights": [{"shape": [2000, 200], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [200], "dtype": "float32", "name": "dense_1/bias"}, {"shape": [200, 96], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [96], "dtype": "float32", "name": "dense_2/bias"}, {"shape": [96, 8], "dtype": "float32", "name": "embedding_1/embeddings"}, {"shape": [8, 800], "dtype": "float32", "name": "lstm_1/kernel"}, {"shape": [200, 800], "dtype": "float32", "name": "lstm_1/recurrent_kernel"}, {"shape": [800], "dtype": "float32", "name": "lstm_1/bias"}, {"shape": [200, 800], "dtype": "float32", "name": "lstm_2/kernel"}, {"shape": [200, 800], "dtype": "float32", "name": "lstm_2/recurrent_kernel"}, {"shape": [800], "dtype": "float32", "name": "lstm_2/bias"}, {"shape": [200, 800], "dtype": "float32", "name": "lstm_3/kernel"}, {"shape": [200, 800], "dtype": "float32", "name": "lstm_3/recurrent_kernel"}, {"shape": [800], "dtype": "float32", "name": "lstm_3/bias"}], "paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"]}], "generatedBy": "keras v2.1.3", "convertedBy": "TensorFlow.js Converter v1.2.2.1", "modelTopology": {"model_config": {"config": [{"config": {"embeddings_regularizer": null, "embeddings_constraint": null, "batch_input_shape": [null, 10], "input_dim": 96, "activity_regularizer": null, "name": "embedding_1", "dtype": "float32", "output_dim": 8, "trainable": true, "mask_zero": false, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "input_length": 10}, "class_name": "Embedding"}, {"config": {"recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "go_backwards": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 1, "dropout": 0.0, "activity_regularizer": null, "name": "lstm_1", "unit_forget_bias": true, "trainable": true, "return_state": false, "bias_constraint": null, "activation": "tanh", "return_sequences": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 200, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "unroll": false, "stateful": false}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "go_backwards": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 1, "dropout": 0.0, "activity_regularizer": null, "name": "lstm_2", "unit_forget_bias": true, "trainable": true, "return_state": false, "bias_constraint": null, "activation": "tanh", "return_sequences": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 200, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "unroll": false, "stateful": false}, "class_name": "LSTM"}, {"config": {"recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "go_backwards": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 1, "dropout": 0.0, "activity_regularizer": null, "name": "lstm_3", "unit_forget_bias": true, "trainable": true, "return_state": false, "bias_constraint": null, "activation": "tanh", "return_sequences": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 200, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "unroll": false, "stateful": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 200, "name": "dense_1", "trainable": true, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 96, "name": "dense_2", "trainable": true, "activation": "softmax", "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "keras_version": "2.1.3", "backend": "tensorflow"}}